import re

# \d+ \.? \d+
# 判断用户输入的内容是否是数字，如果是数字转换成为数字类型
num = input('请输入一段数字：')
if re.fullmatch(r'\d+\.?\d*', num):
    print('是个数字')
    print(float(num))
else:
    print('不是一个数字')

# 以非数字开头，后面有 字母数字_-组成的长度4到14位
# r'^\D[a-z0-9A-Z_\-]{3.13}'


# 邮箱正则  a.jiang@t.1.q.cn
# r'^([A-Za-z0-9_\-\.])+@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$'

# 手机号 130-139  145-147
# r'^((13[0-9]))|(14[5|7])|(15([0-3]|[]5-9))|(18[05-9])\d{8}$'

# 身份证号
r'^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$'
