# 1:%占位符
name = '张三'
age = 20
print('我叫%s,今年%d岁' % (name, age))  # 我叫张三,今年20岁

# 2:{} format
print('我叫{}，今年{}岁'.format(name, age))  # 我叫张三，今年20岁

# 3：f表达式可以解析任意的数据类型
print(f'我叫{name}，今年{age}岁')  # 我叫张三，今年20岁,与上句代码相同结果

print('%10d' % 99)  # 10表示宽度
print('%.3f' % 3.1415926)  # 。3表示的是小数点后三位
# 同时表示宽度和精度
print('%10.3f' % 3.1415926)  # 一共总宽度为10，小数点后3位

print('{}'.format(3.1415926))
print('{:.3}'.format(3.1415926))  # 3.14 :.3表示的是一共3位数
print('{:.3f}'.format(3.1415926))  # 3.142 :.3f表示的3位小数
print('{:10.3f}'.format(3.1415926))  # 同时设置宽度和精度，一共是10位，精度是3位小数
